Repository: lnsiqueira/web_app_pedido_mesa
Catalog: lib/l10n/app_*.arb
Languages: es, pt

source: Hello World!
es: ¡Hola!
pt: Olá!

source: Tap to start
es: Toca para comenzar
pt: Toque para começar

# scan
source: Scan the product on the reader
es: Escanee el producto en el lector
pt: Escaneie o produto no leitor

# weighDish
source: Do you want to weigh your dish?
es: ¿Quieres pesar tu plato?
pt: Deseja pesar seu prato?

source: Yes
es: Sí
pt: Sim

source: No
pt: Não

# readProdcut
source: Read the product in the reader below
es: Lea el producto en el lector a continuación
pt: Leia o produto no leitor abaixo

# readQRCode
source: Read your QR Code
es: Lee tu código QR
pt: Leia seu Qr Code

source: Your cart
es: Tu carrito
pt: Seu carrinho

# cartEmpty
source: Your cart is empty,
es: Tu carrito esta vacío,
pt: Seu carrinho está vazio,

# addItem
source: add some item!
es: ¡Añade algún artículo!
pt: adicione algum item!

source: Cancel
es: Cancelar
pt: Cancelar

# continueText
source: Continue
es: Continuar
pt: Prosseguir

# finalizarText
source: Finish
es: Finalizar
pt: Finalizar

source: Attention!
es: ¡Atención!
pt: Atenção!

# addSomething
source: Please add something to your cart before proceeding.
es: Añade algo a tu carrito antes de continuar.
pt: Adicione alguma coisa no seu carrinho antes de prosseguir.

source: Invalid CPF.
es: CPF no válido.
pt: CPF inválido.

# addDish
source: Add new dish
es: AÑADIR NUEVO PLATO
pt: ADICIONAR NOVO PRATO

# weigh
source: WEIGHT (KG)
es: PESO (KG)
pt: PESO (KG)

# price
source: PRICE/KG
es: PRECIO/KG
pt: PREÇO/KG

# orderCancel
source: Your order will be canceled
es: Tu pedido se cancelará
pt: Seu pedido será cancelado

# inText
source: in
es: en
pt: em

source: seconds
es: segundos
pt: segundos

# inactivity
source: due to inactivity.
es: debido a inactividad.
pt: por inatividade.

# wantContinue
source: Do you want to continue with the order?
es: ¿Quieres continuar con el pedido?
pt: Deseja continuar com o pedido?

source: Cancel Order
es: Cancelar pedido
pt: Cancelar pedido

# continueOrder
source: Continue
es: Continuar
pt: Continuar

# wantCPF
source: Do you want to enter your CPF?
es: ¿Quieres ingresar tu CPF?
pt: Deseja informar seu CPF?

# providingCPF
source: By providing your CPF, you'll accumulate points and we'll be able to make exclusive offers for you!
es: Al ingresar tu CPF, acumulas puntos y podemos ofrecerte ofertas exclusivas.
pt: Informando seu CPF você acumula pontos e conseguimos fazer ofertas exclusivas para você!

# benefitsUpcoming
source: These benefits can be used with our upcoming app!
es: ¡Puedes usar estos beneficios con nuestra próxima app!
pt: Esses benefícios poderão ser usados com o nosso app que está chegando!

# dontWant
source: I don't want to inform
es: No quiero informar
pt: Não quero informar

# wantpay
source: How do you want to pay for your purchase?
es: ¿Cómo desea pagar su compra?
pt: Como deseja pagar sua compra?

# invoiceCPF
source: Do you want your CPF on the invoice?
es: ¿Desea que su número de CPF aparezca en el recibo?
pt: Deseja CPF na nota?

source: Please wait...
es: Por favor, espere...
pt: Por favor, aguarde...

# pesando
source: Weighing...
es: Peso...
pt: Pesando...

# processingRequest
source: We are processing your request.
es: Estamos procesando su solicitud.
pt: Estamos processando sua solicitação.

# wantPrintInvoice
source: Do you want to print an invoice?
es: ¿Quieres imprimir una factura?
pt: Deseja imprimir cupom fiscal?

# returnHome
source: Returning to home due to inactivity
es: Regreso a la pantalla de inicio debido a la inactividad
pt: Voltando para tela inicial por inatividade

source: Canceling in
es: Cancelando en
pt: Cancelando em

# continuePage
source: Continue on page
es: Continuar en la página
pt: Continuar na página

source: place your order
es: Haz tu pedido
pt: faça seu pedido

# enterTableNumber
source: Enter the table number
es: Ingrese el número de mesa
pt: Informe o número da mesa

source: Table
es: Mesa
pt: Mesa

# enterOrderNumber
source: Enter the order number
es: Introduzca el número de pedido
pt: Informe o número do comanda

source: Order
es: Pedido
pt: Comanda
